[
  "[File: stacks-core/stackslib/src/util_lib/boot.rs] [All Functions] [Mainnet Parameter] Is there any validation that ensures the mainnet boolean is consistent across all boot code function calls within a single transaction or block processing context? (High)",
  "[File: stacks-core/stackslib/src/util_lib/boot.rs] [All Functions] [Boot Code Authority] Do these utility functions ensure that only authorized system processes can create boot code contracts, or could an external attacker call these functions to impersonate boot code? (Critical)",
  "[File: stacks-core/stackslib/src/util_lib/boot.rs] [All Functions] [Burn Address Security] Is the burn address mechanism secure against private key generation or collision attacks that could allow an attacker to control the boot code address? (Critical)",
  "[File: stacks-core/stackslib/src/util_lib/boot.rs] [Function: boot_code_test_addr()] [Test Code Leakage] Could the boot_code_test_addr() function accidentally be called in production code paths, causing mainnet to use testnet boot addresses? (High)",
  "[File: stacks-core/stackslib/src/util_lib/boot.rs] [Function: boot_code_test_addr()] [Conditional Compilation] Is the #[cfg(test)] annotation sufficient to prevent this test helper from being compiled into production binaries? (Medium)",
  "[File: stacks-core/stackslib/src/util_lib/boot.rs] [Module Level] [Import Security] Are all imported types (STXBalance, PrincipalData, MessageSignature, etc.) from trusted modules that maintain consensus-critical invariants? (Medium)",
  "[File: stacks-core/stackslib/src/util_lib/boot.rs] [Module Level] [Boot Contract Uniqueness] Is there any mechanism to ensure that boot contract identifiers created by boot_code_id() are unique and cannot collide with user-deployed contracts? (Critical)",
  "[File: stacks-core/stackslib/src/util_lib/boot.rs] [Module Level] [Deterministic Construction] Are all object constructions in this module guaranteed to be deterministic across different node implementations, architectures, and Rust compiler versions? (Critical)",
  "[File: stacks-core/stackslib/src/util_lib/boot.rs] [Module Level] [Error Handling] The module has no explicit error handling - could this lead to panics in production if any underlying function (like ContractName::try_from()) fails? (High)",
  "[File: stacks-core/stackslib/src/util_lib/boot.rs] [Module Level] [Hardcoded Constants] Are the hardcoded values (nonce=0, tx_fee=0, empty signature, P2PKH hash mode, Uncompressed encoding) documented as security-critical consensus constants that must never change? (Medium)",
  "[File: stacks-core/stackslib/src/util_lib/boot.rs] [Module Level] [Boot Code Privilege] Do these utilities properly enforce that boot code has special privileges (zero fees, unsigned transactions) only during system initialization and not during normal operation? (Critical)"
]