[
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: stack-aggregation-increase()] [Validation] Can reward-cycle be less than or equal to current-pox-reward-cycle, allowing increases to past or current cycles that should be immutable? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: stack-aggregation-increase()] [State Consistency] Can unwrap-panic on map-get reward-cycle-total-stacked cause runtime abort if the reward cycle was never initialized? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: stack-aggregation-increase()] [State Consistency] Can unwrap! on map-get reward-cycle-pox-address-list return error if the reward-cycle-index is out of bounds or points to a deleted entry? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: stack-aggregation-increase()] [Integer Overflow] Can adding total-ustx and amount-ustx overflow, causing the total to wrap to a small value and allowing infinite stacking? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: stack-aggregation-increase()] [Integer Overflow] Can adding total-ustx of existing-entry and amount-ustx overflow, causing increased-ustx to underrepresent the true total? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: stack-aggregation-increase()] [Validation Bypass] Can minimal-can-stack-stx pass with a total-ustx that fails the stacking minimum, allowing aggregation below the threshold? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: stack-aggregation-increase()] [Validation] If the stacker field in existing-entry is some, can the is-none check fail to detect delegator abuse where direct stackers increase aggregation? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: stack-aggregation-increase()] [Validation] Can an attacker pass a pox-addr that doesn't match existing-entry.pox-addr due to buffer comparison issues with trailing bytes? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: stack-aggregation-increase()] [State Consistency] After updating reward-cycle-pox-address-list and reward-cycle-total-stacked, if map-delete fails silently, can the partial amount be reused? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: delegate-stack-stx()] [Integer Overflow] Can adding u1 to current-pox-reward-cycle overflow, causing delegation to past reward cycles? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: delegate-stack-stx()] [Integer Overflow] Can adding current-pox-reward-cycle, u1, and lock-period overflow when calculating unlock-burn-height? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: delegate-stack-stx()] [Validation] Can the is-eq check for first-reward-cycle and specified-reward-cycle be bypassed if start-burn-ht causes burn-height-to-reward-cycle to wrap? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: delegate-stack-stx()] [State Consistency] Can unwrap! on get-check-delegation fail to return proper delegation info if the expiry logic has errors? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: delegate-stack-stx()] [Access Control] Can an attacker delegate-stack for a user who delegated to a different delegate by exploiting stale delegation info? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: delegate-stack-stx()] [Validation] Can amount-ustx exceed the delegated amount-ustx if the >= check has off-by-one errors? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: delegate-stack-stx()] [Validation] Can the match on pox-addr delegation fail to enforce address matching if buffer comparison has issues with different length hashbytes? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: delegate-stack-stx()] [Validation] Can the match on until-burn-ht allow delegation to expire during the lock period if the >= comparison is incorrect? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: delegate-stack-stx()] [State Consistency] Can get-stacker-info return none while stacking-state has an entry, allowing double-stacking through delegation? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: delegate-stack-stx()] [Balance Check] Can stx-get-balance return a value less than amount-ustx if concurrent transactions spend funds, but still pass the check? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: delegate-stack-stx()] [State Consistency] After add-pox-partial-stacked succeeds but before map-set stacking-state, can a failure leave partial stacking recorded without a stacker entry? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: delegate-stack-stx()] [State Consistency] Can the empty list for reward-set-indexes create issues when later operations expect a non-empty list? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: reject-pox()] [Integer Overflow] Can adding u1 to current-pox-reward-cycle overflow, causing rejection votes to apply to the wrong cycle? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: reject-pox()] [Balance Check] Can stx-get-balance return a stale value that changes before the vote is recorded, allowing more votes than the user actually has? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: reject-pox()] [Validation] Can get-pox-rejection return a stale none if stacking-rejectors wasn't properly initialized for the reward cycle? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-3.clar] [Function: reject-pox()] [State Consistency] Can get-stacker-info incorrectly return none, allowing a stacker to also reject PoX and double-count their balance? (Critical)"
]