[
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Variable Overwrite] Could the cargo:rustc-env directives overwrite existing environment variables that are used elsewhere in the build system, causing inconsistent or compromised builds? (Medium)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Variable Injection] Are there any restrictions on the format or content of values passed to println!() cargo directives that could inject additional cargo instructions? (High)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Non-Determinism] Including git commit hash, branch name, and tree cleanliness in the build output makes builds non-deterministic - could this prevent verification that consensus-critical binaries were built from known-good source code? (Critical)",
  "[File: stacks-core/stacks-common/build.rs] [Function: is_working_tree_clean()] [Build Reproducibility] The GIT_TREE_CLEAN constant changes based on local working directory state - could this cause different builds from the same commit to produce different binaries, breaking reproducible builds for security verification? (High)",
  "[File: stacks-core/stacks-common/build.rs] [Function: current_git_hash()] [Version Spoofing] If the GIT_COMMIT environment variable is set before build, it takes precedence over the actual git commit - could this allow an attacker to build binaries that report false version information? (High)",
  "[File: stacks-core/stacks-common/build.rs] [Function: current_git_branch()] [Branch Spoofing] Similar to commit spoofing, could the GIT_BRANCH environment variable be used to make a build from one branch appear to be from another, bypassing security policies that restrict certain branch deployments? (High)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Timestamp Dependencies] Does the build script have any implicit dependencies on file modification times or system time that could affect determinism beyond the explicit git metadata? (Medium)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Panic on Parse] The expect() call when parsing TOML will panic on malformed input - could an attacker commit a malformed versions.toml to prevent builds, creating a denial of service? (Medium)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Panic on Read] The expect() when reading versions.toml will panic if the file doesn't exist - could an attacker delete or move this file in a CI/CD pipeline to prevent deployments? (Medium)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Panic on Write] The expect() when writing the generated file could panic on disk full or permission errors - does this leave the build in an inconsistent state that could be exploited? (Low)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Panic on Type Mismatch] The panic!() calls when TOML values aren't the expected types could be triggered by a malicious versions.toml - is there a graceful fallback or should the build fail open? (Medium)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Silent Failures] Git commands can fail silently and return None - are there security implications if version information is missing from the compiled binary? (Medium)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Dependency Confusion] The script depends on the 'toml' crate for parsing - could an attacker publish a malicious version of this dependency to compromise builds? (Critical)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Build Script Execution] As a build.rs script, this code executes with the privileges of the build user - could it be leveraged as part of a supply chain attack to exfiltrate credentials, modify source, or inject backdoors? (Critical)",
  "[File: stacks-core/stacks-common/build.rs] [Function: run_git_command()] [Git Hook Execution] When git commands execute, they can trigger git hooks - could malicious hooks in the repository be used to compromise the build process? (High)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [TOML Bomb] Could a versions.toml file be crafted with deeply nested structures or excessive keys that cause the TOML parser to consume excessive memory or CPU, creating a denial of service? (Medium)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Version String Manipulation] If version constants from versions.toml are used in consensus-critical protocol logic (version negotiation, fork activation), could manipulated values cause nodes to fork or reject valid blocks? (Critical)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Build-Time Configuration] Are any consensus-critical parameters defined in versions.toml that, if modified, could cause nodes to diverge in their validation logic or state transitions? (Critical)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Identifier Injection Attack] Could uppercase identifier generation from TOML keys create constants that shadow or collide with consensus-critical constants defined elsewhere in the codebase? (High)",
  "[File: stacks-core/stacks-common/build.rs] [Function: is_working_tree_clean()] [TOCTOU Race] There's a time-of-check-time-of-use race between checking if the tree is clean and when that information is embedded in the binary - could files be modified in this window? (Medium)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [File Write Race] Is there a race condition between writing versions.rs and the Rust compiler reading it, where an attacker could swap the file contents? (Medium)",
  "[File: stacks-core/stacks-common/build.rs] [Function: current_git_hash()] [Git State Race] If git commands execute during an active rebase or other git operation, could inconsistent state be captured and embedded in the build? (Low)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [UTF-8 Validation] The from_utf8() call on command output could fail for non-UTF-8 git output - is this handled securely, or could it cause panics or mojibake in version strings? (Low)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [String Trimming] The trim() operation on git command output could remove significant whitespace - could this normalize malicious input in unexpected ways? (Low)",
  "[File: stacks-core/stacks-common/build.rs] [Function: main()] [Table Iteration Order] The for loop over TOML table entries may have undefined order - could this cause non-deterministic ordering of generated constants affecting build reproducibility? (Medium)"
]