[
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-testnet.clar] [Constants: MIN_POX_REWARD_CYCLES, MAX_POX_REWARD_CYCLES] [Configuration Error] Could the MIN_POX_REWARD_CYCLES value of u1 allow users to lock STX for too short a period, potentially enabling gaming of reward cycles or rapid unlock/relock patterns that violate economic security assumptions? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-testnet.clar] [Constants: MIN_POX_REWARD_CYCLES, MAX_POX_REWARD_CYCLES] [Invariant Violation] Could setting MAX_POX_REWARD_CYCLES to u12 create an upper bound that is inconsistent with other protocol parameters, leading to reward cycle calculation overflows or incorrect tenure boundaries in consuming contracts? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-testnet.clar] [Constant: PREPARE_CYCLE_LENGTH] [Consensus Divergence] Could the PREPARE_CYCLE_LENGTH value of u50 burnchain blocks be insufficient for validators to complete PoX registration, potentially causing consensus failures or missed reward cycles if Bitcoin block production is irregular? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-testnet.clar] [Constant: REWARD_CYCLE_LENGTH] [Economic Attack] Could the REWARD_CYCLE_LENGTH of u1050 blocks create a mismatch with PREPARE_CYCLE_LENGTH (u50) such that the ratio allows off-by-one errors in cycle boundary calculations in consuming contracts? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-testnet.clar] [Constants: ADDRESS_VERSION_*] [Validation Bypass] Are all four Bitcoin address version constants (0x00, 0x01, 0x02, 0x03) properly validated in consuming contracts to prevent acceptance of malformed or unsupported Bitcoin address types that could lead to unspendable rewards? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-testnet.clar] [Constants: STACKING_THRESHOLD_25, STACKING_THRESHOLD_100] [Economic Invariant] Could the STACKING_THRESHOLD_25 value of u8000 and STACKING_THRESHOLD_100 value of u2000 create an inconsistent ratio (4:1 instead of expected 4:1 based on names) that violates stacking threshold invariants and allows Sybil attacks through threshold manipulation? (Critical)"
]