[
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: can-stack-stx()] [Minimum Threshold] Does get-stacking-minimum at line 374 use current stx-liquid-supply, and can this change between validation and actual stacking, allowing amounts below threshold to be stacked? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: minimal-can-stack-stx()] [Amount Zero Check] Does the check at line 390 prevent amount-ustx of u0, or can zero-amount stacking bypass minimum threshold checks? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: minimal-can-stack-stx()] [Already Rejected Check] At line 394, can get-pox-rejection return none for an existing rejection if stacking-rejectors map is not properly set, allowing stacking after rejection? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: minimal-can-stack-stx()] [Lock Period Bounds] Does check-pox-lock-period at line 398 properly enforce MIN_POX_REWARD_CYCLES and MAX_POX_REWARD_CYCLES constants, or can these be bypassed? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: check-pox-addr-version()] [Address Version] Does check-pox-addr-version at line 353-357 validate all required Bitcoin address types, or can invalid/unsupported versions pass validation? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: check-pox-lock-period()] [Period Validation] At line 360-362, are MIN_POX_REWARD_CYCLES and MAX_POX_REWARD_CYCLES defined as constants elsewhere, and what prevents lock-period from being set to extreme values? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: add-pox-addr-to-reward-cycles()] [Cycle Limit] At line 298, the cycle-indexes list supports up to 12 cycles - can num-cycles exceed 12 to bypass the assertion at line 301, causing incomplete reward cycle registration? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: add-pox-addr-to-ith-reward-cycle()] [Total STX Overflow] Can the total-ustx addition at line 284 overflow when multiple stackers add large amounts, wrapping to a small value and corrupting reward distribution? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: add-pox-addr-to-ith-reward-cycle()] [Duplicate Registration] Does append-reward-cycle-pox-addr at line 276 check for duplicate pox-addr in the same reward cycle, or can the same address be added multiple times to multiply rewards? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: append-reward-cycle-pox-addr()] [Index Increment] At line 237, is the index incremented atomically after insertion, or can concurrent calls cause index collisions overwriting reward set entries? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: add-pox-addr-to-ith-reward-cycle()] [Condition Check] At line 273, if i >= num-cycles, does the function still increment i correctly, or can this cause the assertion at line 301-304 to fail incorrectly? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: add-pox-partial-stacked()] [Cycle Limit] Similar to line 298, does add-pox-partial-stacked at line 342 enforce that num-cycles <= 12, or can more cycles be added? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: add-pox-partial-stacked-to-ith-cycle()] [Amount Accumulation] At line 328, can the stacked-amount addition overflow when accumulating multiple partial stakes, wrapping to incorrect totals? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: add-pox-partial-stacked-to-ith-cycle()] [Sender Identity] Does the map key at line 321 use tx-sender, allowing a delegate to register partial stakes under their own identity instead of the actual stacker's? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: add-pox-partial-stacked-to-ith-cycle()] [Reward Cycle Increment] Is reward-cycle incremented correctly at line 331, or can this cause partial stakes to be registered to wrong cycles? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: stack-aggregation-commit()] [Minimum Threshold] Does can-stack-stx at line 543 check that aggregated amount meets the minimum threshold, or can partial stakes below minimum be committed? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: stack-aggregation-commit()] [Partial Stack Lookup] At line 537, if partial-stacked-by-cycle returns none, does this mean no partial stake exists, or could the map be corrupted? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: stack-aggregation-commit()] [Double Commit] After map-delete at line 557, can stack-aggregation-commit be called again with the same parameters to register the same amount twice in the reward cycle? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: stack-aggregation-commit()] [STX Lock Status] At line 554, the comment says 'don't lock the STX' - but is the STX actually locked elsewhere in delegate-stack-stx, or can uncommitted partial stakes remain unlocked? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: stack-aggregation-commit()] [Reward Cycle Timing] Can stack-aggregation-commit be called after the reward cycle's anchor block, allowing late commits that violate consensus rules? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: delegate-stack-stx()] [Delegation Verification] At line 581, if get-check-delegation returns valid delegation, can the delegated-to field be manipulated to differ from tx-sender? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: delegate-stack-stx()] [Amount Verification] At line 586, does the check prevent delegating more than delegated amount, or can amount-ustx be slightly over due to rounding? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: delegate-stack-stx()] [PoX Address Match] At line 589-591, if delegation requires specific pox-addr, can a delegate use a different address that matches by hash collision? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: delegate-stack-stx()] [Expiration Check] At line 594-597, is until-burn-ht compared correctly with unlock-burn-height to prevent delegation expiring during lock? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Function: delegate-stack-stx()] [Unlock Height] At line 570, is unlock-burn-height calculated correctly, or is there an off-by-one that causes early/late unlock? (High)"
]