[
  "[File: stacks-core/stacks-common/src/libcommon.rs] [Constant: MICROSTACKS_PER_STACKS] [STX Conversion] Could the conversion factor of 1,000,000 microSTX per STX be exploited through rounding errors in division operations when converting between denominations, potentially allowing attackers to extract fractional STX amounts through repeated conversions? (High)",
  "[File: stacks-core/stacks-common/src/libcommon.rs] [Constant: MICROSTACKS_PER_STACKS] [Balance Overflow] If balance calculations multiply STX amounts by MICROSTACKS_PER_STACKS (1,000,000) without checking for overflow, could an attacker cause integer wrapping by transferring amounts near u64::MAX / 1,000,000, corrupting account balances? (Critical)",
  "[File: stacks-core/stacks-common/src/libcommon.rs] [Constant: MICROSTACKS_PER_STACKS] [Fee Calculation] Could transaction fee calculations that use MICROSTACKS_PER_STACKS for conversion between user-facing STX amounts and protocol microSTX amounts be exploited to specify fees that appear large in STX terms but are actually insufficient when converted to microSTX? (High)",
  "[File: stacks-core/stacks-common/src/libcommon.rs] [Module: deps_common] [Dependency Safety] Does the public re-export of bitcoin, bech32, and httparse dependencies through deps_common introduce any version conflicts or API inconsistencies that could lead to different parsing behavior across modules? (Medium)",
  "[File: stacks-core/stacks-common/src/libcommon.rs] [Module: versions] [Build-time Injection] If the versions module is included from OUT_DIR (build output), could a compromised build environment inject malicious version constants that cause nodes to accept incompatible protocol versions or bypass version checks? (High)",
  "[File: stacks-core/stacks-common/src/libcommon.rs] [Macro: #[macro_use]] [Macro Hygiene] Do the macro_use declarations for util and codec modules properly scope macros to prevent naming collisions that could cause unexpected macro expansion in security-critical validation code? (Medium)",
  "[File: stacks-core/stacks-common/src/libcommon.rs] [Constants: CHAIN_ID_*, PEER_VERSION_*, NETWORK_ID_*] [Field Confusion] Could validation code that checks multiple network-related constants (chain ID, peer version, network ID) be exploited by mixing valid values from different contexts, such as using a mainnet chain ID with testnet peer version to bypass network isolation? (Critical)",
  "[File: stacks-core/stacks-common/src/libcommon.rs] [Constants: FIRST_STACKS_BLOCK_HASH, FIRST_BURNCHAIN_CONSENSUS_HASH] [Sentinel Value Collision] Do the all-zero sentinel values for first block hash and first consensus hash create ambiguity with error conditions or uninitialized data that could allow invalid blocks to pass validation in edge cases? (High)",
  "[File: stacks-core/stacks-common/src/libcommon.rs] [Constants: PEER_VERSION_EPOCH_2_0, PEER_VERSION_EPOCH_1_0] [Epoch Numbering] Why do PEER_VERSION_EPOCH_1_0 and PEER_VERSION_EPOCH_2_0 both have value 0x00? Could this duplicate value cause epoch detection logic to incorrectly classify nodes as running the wrong epoch, leading to consensus failures? (Critical)"
]