[
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Variable: recipient] [Initialization] Is the recipient variable initialized to tx-sender during deployment, and could this cause unauthorized access if the deployment transaction is sent from an incorrect address? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Constant: INITIAL_MINT_AMOUNT] [Balance Assumption] The contract assumes a balance of at least 200M STX upon deployment - what happens if the actual balance is less, and can this cause the reserved calculation to exceed balance, locking all funds? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Constant: INITIAL_MINT_VESTING_ITERATION_BLOCKS] [Block Time Assumption] Is the assumption of 4383 blocks per month (≈10 minutes per block) correct for Bitcoin, and could variations in actual block times cause the vesting schedule to deviate significantly from 24 months? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: update-recipient()] [State Transition] Can update-recipient() be called multiple times in quick succession to change the recipient to different addresses, and could this create a race condition where claims go to unintended recipients? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: update-recipient()] [Access Loss] If the recipient is updated to an address for which no one has the private keys, are the funds permanently locked, and is there any recovery mechanism? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: update-recipient()] [Contract Recipient] Even though is-standard checks if the new-recipient is a standard principal, could there be edge cases where a contract address passes this check, leading to funds being locked in a contract? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: update-recipient()] [Event Log] Does the print statement for update-recipient emit events that could be monitored off-chain, and could a missing or incorrect event cause external systems to lose track of the current recipient? (Low)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: update-recipient()] [Validation Timing] Is the is-standard check performed before or after the recipient is updated, and could there be a race condition where an invalid recipient is temporarily set? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: claim()] [Denial of Service] Can an attacker front-run a legitimate claim() call by updating the recipient to a different address, causing the original claim to fail with ERR_NOT_ALLOWED and denying access to vested funds? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: claim()] [Zero Amount] Does the check '(> claimable u0)' correctly prevent claims when nothing is available, or could edge cases allow a successful claim of zero STX that still emits an event and wastes gas? (Low)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: claim()] [Transfer Failure] If the stx-transfer fails due to recipient being invalid or unable to receive (despite passing is-standard earlier), what happens to the funds, and can they be recovered? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: claim()] [as-contract Context] Does the 'as-contract' wrapper correctly set tx-sender to the contract's principal for the stx-transfer, and could context manipulation cause the transfer to fail or send from the wrong address? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: claim()] [Event Accuracy] Does the print statement emit the actual transferred amount, or could there be a discrepancy if the transfer partially fails or if balance changes between calculation and transfer? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: claim()] [Multiple Claims] Can claim() be called multiple times per block or per vesting period, and does each call correctly calculate only the newly claimable amount, or could it re-claim already withdrawn funds? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: calc-claimable-amount()] [Pre-Deployment] What happens if calc-claimable-amount is called with a burn-height less than DEPLOY_BLOCK_HEIGHT - does it correctly return u0, and is this check sufficient to prevent underflow in calc-total-vested? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: calc-total-vested()] [Maximum Vesting] After 24 vesting iterations complete, does the contract correctly prevent total-vested from exceeding INITIAL_MINT_AMOUNT, or could continued time passage cause issues? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: calc-total-vested()] [Burn Height Zero] What happens if burn-height is zero or very small - can this cause arithmetic issues in the diff calculation or division operations? (Low)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: calc-claimable-amount()] [Balance Zero] If the contract's balance is completely drained to zero (through claims or unexpected transfers), does calc-claimable-amount correctly return u0 without causing arithmetic errors? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: calc-claimable-amount()] [Reserved Exceeds Balance] If reserved somehow exceeds balance due to a bug, the condition '(> balance reserved)' returns false and claimable becomes u0 - but does this permanently lock funds even when more becomes available later? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Constant: INITIAL_MINT_VESTING_ITERATIONS] [Iteration Boundary] When iterations reaches exactly u24, does the >= check trigger the full vesting amount, and is there any risk of off-by-one causing iteration u23 to be the final iteration? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: calc-claimable-amount()] [Per-Tenure Accounting] When per-tenure mints are added to the contract balance, are they immediately available for withdrawal, and could this allow the recipient to claim more than the intended vested amount in a given period? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: calc-claimable-amount()] [Balance Inflation] If per-tenure mints exceed the expected amounts, can the claimable calculation correctly distinguish between vested funds and extra minted funds, or could accounting confusion allow unauthorized withdrawals? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: calc-claimable-amount()] [Reserved Calculation] Does the reserved amount calculation account for per-tenure mints, or does it only consider the initial 200M STX, potentially causing claimable to be calculated incorrectly when extra mints are present? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Function: claim()] [Mint Timing] Can per-tenure mints arrive in the middle of a block or between the claimable calculation and stx-transfer, causing a race condition where the amount claimed differs from the calculated amount? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/sip-031.clar] [Overall Contract] [Invariant Violation] Can the sum of all claimed amounts ever exceed the contract's intended maximum distribution (200M initial + per-tenure mints), violating the fundamental STX supply invariant? (Critical)"
]