[
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Function: AttachmentInstance::try_new_from_value()] [Optional Field Handling] The canonical_stacks_tip_height is optional. Could None values be mishandled in comparisons or arithmetic operations elsewhere, causing integer underflows or incorrect ordering? (Medium)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Function: AttachmentInstance::try_new_from_value()] [Block Height Validation] There's no validation that stacks_block_height is reasonable or monotonic. Could an attacker pass u64::MAX as the block height to cause overflow in height-based calculations? (High)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Function: AttachmentInstance::try_new_from_value()] [Txid Validation] The tx_id is passed directly without validation. Could a zero Txid or malformed Txid cause database lookup failures or index corruption? (Medium)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Function: AttachmentInstance::try_new_from_value()] [Contract ID Validation] The contract_id is cloned without checking if it's in the AtlasConfig.contracts whitelist. Could this allow non-whitelisted contracts to create attachment instances that are processed before filtering? (High)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Constant: MAX_ATTACHMENT_INV_PAGES_PER_REQUEST] [DoS] Can an attacker request exactly MAX_ATTACHMENT_INV_PAGES_PER_REQUEST (8) pages repeatedly to cause network flooding, and is there per-peer rate limiting to prevent this? (High)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Constant: MAX_RETRY_DELAY] [Timing Attack] The MAX_RETRY_DELAY of 600 seconds could allow attackers to intentionally delay attachment propagation. Could this enable eclipse attacks where a node never receives critical attachments? (Medium)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Constant: ATTACHMENTS_CHANNEL_SIZE] [Deadlock] If the channel buffer size is 5, and 5 large attachment batches are queued but processing stalls, could this cause the coordinator to block indefinitely waiting for capacity? (High)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Constant: ATTACHMENTS_MAX_SIZE_MIN] [Inconsistent Limits] The minimum attachment size is 1MB. Could nodes with attachments_max_size set to exactly 1MB interpret size limits differently (inclusive vs exclusive) and reject attachments other nodes accept? (High)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Constant: MAX_UNINSTANTIATED_ATTACHMENTS_MIN] [Memory Exhaustion] With a minimum of 50,000 uninstantiated attachments allowed, and each potentially 1MB, could a node be forced to allocate up to 50GB of memory for uninstantiated attachments alone? (Critical)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Constant: UNINSTANTIATED_ATTACHMENTS_EXPIRE_AFTER_MIN] [Expiration Off-by-One] Is the 86,400 second (1 day) expiration checked with >= or >? Could attachments that are exactly 86,400 seconds old be treated inconsistently? (Medium)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Constant: UNRESOLVED_ATTACHMENT_INSTANCES_EXPIRE_AFTER_MIN] [Expiration Race] With a 2-day (172,800 second) expiration for unresolved instances, could an attacker create attachment instances that never get resolved, occupying memory for the full 2 days repeatedly? (High)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Regex: BNS_CHARS_REGEX] [Validation Bypass] The regex allows hyphens and underscores at any position. Could leading/trailing hyphens in BNS names cause parsing errors or database key collisions elsewhere in the codebase? (Medium)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Regex: BNS_CHARS_REGEX] [ReDoS] Although the regex is simple, does the '*' quantifier on the character class allow for ReDoS attacks with extremely long strings? (Low)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Regex: BNS_CHARS_REGEX] [Unicode Handling] The regex only accepts ASCII lowercase and limited punctuation. Could Unicode normalization or case folding cause the same name to be validated differently before and after regex checking? (Medium)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Constant: ATTACHMENTS_INV_PAGE_SIZE] [Inventory Calculation] With a page size of 64, could integer overflow occur when calculating page indices for attachment_index values near u32::MAX? (High)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Constant: ATTACHMENTS_INV_PAGE_SIZE] [Bit Vector Alignment] If inventory is represented as a bit vector with 64 attachments per page, could misaligned bit operations cause attachments to be marked as present/absent incorrectly? (High)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Struct: GetAttachmentsInvResponse] [DoS] Can an attacker include an unlimited number of AttachmentPages in the pages vector, causing memory exhaustion during deserialization? (High)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Struct: GetAttachmentsInvResponse] [Validation] Is block_id validated to correspond to an actual Stacks block? Could an attacker use a fake StacksBlockId to query for non-existent attachments? (Medium)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Struct: AttachmentPage] [Inventory Size] Is the inventory Vec<u8> length validated? Could an attacker send a page with inventory of unexpected size (e.g., not 8 bytes for 64 bits) causing parsing errors? (High)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Struct: AttachmentPage] [Index Validation] Could duplicate page indices in GetAttachmentsInvResponse.pages cause inconsistent inventory state or allow an attacker to override legitimate inventory data? (Medium)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Struct: AttachmentPage] [Index Overflow] If page index is u32::MAX, could calculations involving index * ATTACHMENTS_INV_PAGE_SIZE overflow and wrap to reference the wrong attachment range? (High)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Cross-module: AtlasConfig + Attachment] [Validation Ordering] If Attachment::new() is called before AtlasConfig::validate(), could invalid configuration values affect how attachments are processed or stored? (High)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Cross-function: Attachment::hash() + AttachmentInstance] [Hash Mismatch] If an AttachmentInstance has content_hash that doesn't match any Attachment's hash(), is this detected as an error, or could orphaned instances remain indefinitely? (High)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Cross-function: try_new_from_value() + serialize()] [Round-trip Consistency] If metadata is deserialized from Clarity Value, serialized to hex, then deserialized again, is it guaranteed to be identical? Could serialization differences cause consensus divergence? (Critical)",
  "[File: stacks-core/stackslib/src/net/atlas/mod.rs] [Genesis Attachments] [Validation] The AtlasConfig.genesis_attachments field is Option<Vec<Attachment>> with no validation. Could genesis attachments bypass size limits or inject malicious content before normal validation applies? (Critical)"
]