[
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: stack-stx()] [Amount Zero] Although minimal-can-stack-stx checks (> amount-ustx u0), can stacking with amount=1 ustx (well below minimum) still pass if the check happens when liquid supply is extremely low? (Low)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: stack-stx()] [Reentrancy] Can calling stack-stx from a contract that implements post-conditions create reentrancy where the same STX are stacked multiple times before the lock is applied? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: stack-stx()] [Reward Set Growth] Calling stack-stx adds one entry per cycle to reward-cycle-pox-address-list - with max 12 cycles, can this cause the list to grow unboundedly over many reward cycles? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: stack-stx()] [Cycle Boundary] If stack-stx is called at the exact moment when burn-block-height transitions to a new cycle, can current-pox-reward-cycle return inconsistent values in different parts of the execution? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: stack-stx()] [Integer Overflow] If amount-ustx is near u128 max and multiple stackers stack to the same pox-addr, can reward-cycle-total-stacked overflow and wrap around? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stx()] [Already Delegated Check] The check (is-none (get-check-delegation tx-sender)) only fails if there's an active delegation - can a user have an expired delegation and call delegate-stx again without revoking? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stx()] [Amount Zero] Can amount-ustx be set to u0, creating a delegation that allows the delegate to stack any amount of the delegator's funds? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stx()] [Until Burn Height] If until-burn-ht is set to u0 or u1 (in the past), does this create an immediately expired delegation that passes initial checks but fails later? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stx()] [POX Address Requirement] If pox-addr is set in delegation but delegate-stack-stx is called with a different address, the check at line 842 should fail - but does it correctly compare optional values? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stx()] [Delegation Override] Can calling delegate-stx while already delegated to delegate-A immediately switch to delegate-B without revoking, potentially violating agreements? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: revoke-delegate-stx()] [Partial Revocation] Does map-delete delegation-state also clear any partial-stacked-by-cycle entries, or can delegated STX remain partially committed after revocation? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: revoke-delegate-stx()] [Already Stacked] If the delegator's STX are already locked via delegate-stack-stx, can they still revoke the delegation and potentially break invariants? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stack-stx()] [Delegation Amount Check] The check (>= (get amount-ustx delegation-info) amount-ustx) at line 838 - if delegation amount is exactly equal, can the delegate stack all delegated STX leaving none for fees? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stack-stx()] [Expiry Calculation] The expiry check compares delegation until-burn-ht against unlock-burn-height - if these are equal, does (>= until-burn-ht unlock-burn-height) incorrectly allow an about-to-expire delegation? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stack-stx()] [Stacker Already Stacked] The check (is-none (get-stacker-info stacker)) at line 853 - can an expired stacker entry allow re-stacking via delegation before the previous lock unlocks? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stack-stx()] [Partial Stacking] delegate-stack-stx calls add-pox-partial-stacked but doesn't directly add to reward-cycle-pox-address-list - can this allow stacking below minimum without commitment? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stack-stx()] [Empty Reward Indexes] The stacking-state is created with reward-set-indexes: (list) - does this empty list violate invariant (5) that len(reward-set-indexes) == lock-period? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stack-stx()] [Unlock Height Return] The returned unlock-burn-height is calculated as (reward-cycle-to-burn-height (+ (current-pox-reward-cycle) u1 lock-period)) - is this consistent with the direct stacking calculation? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stack-stx()] [Minimum Threshold] minimal-can-stack-stx doesn't check the stacking minimum - can a delegate stack 1 ustx, then aggregate to meet minimum, gaming reward distribution? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stack-stx()] [POX Address Match] If delegation specifies pox-addr, the match at line 841 compares tuples - can hash collisions in buff comparison allow a different address? (Low)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stack-stx()] [Start Burn Height] The check (is-eq first-reward-cycle specified-reward-cycle) at line 825 - can calling this function with a past start-burn-ht bypass the check due to integer underflow? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stack-stx()] [Balance Atomicity] The balance check at line 857 happens before the lock - can the stacker transfer STX between check and lock to avoid locking? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stack-stx()] [Multiple Delegators] Can multiple delegates call delegate-stack-stx for the same stacker if delegations overlap, creating multiple stacking-state entries for one principal? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: delegate-stack-stx()] [Cycle Count] The lock-period in delegate-stack-stx can be up to 12 - but add-pox-partial-stacked uses this to add to 12 cycles, can this exceed list bounds? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/pox-2.clar] [Function: allow-contract-caller()] [Expiry None] If until-burn-ht is set to (some none) vs just none, how are these handled differently in check-caller-allowed, and can this cause confusion? (Low)"
]