[
  "[File: stackslib/src/net/api/getsortition.rs] [Function: try_handle_request()] [Transaction Isolation] When calling sortdb.conn() and chainstate methods within with_node_state() on line 311, is there a guarantee that all reads are from the same consistent snapshot? (Critical)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: get_sortition_info()] [MARF Consistency] Can the index_handle created on line 199 be from a different MARF root than the one used for sortition_sn lookups, causing parent block pointer resolution to fail? (Critical)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: get_sortition_info()] [Consensus Invariant] Can the parent_sortition_id on line 242 point to a sortition that's not an ancestor of sortition_id, violating the chain ancestry invariant? (Critical)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: get_sortition_info()] [Consensus Invariant] If a winning sortition has no miner_pk_hash (line 229 returns None), does this violate the requirement that all winning block commits must include VRF key registration? (Critical)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: get_sortition_info()] [Protocol Correctness] Can committed_block_hash on line 231 be None for a winning sortition, and if so, does this indicate an invalid block commit that should never have won? (Critical)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: get_sortition_info()] [VRF Security] Is the vrf_seed on line 233 properly validated to match the miner's VRF proof from the block commit, or can mismatched seeds be returned? (Critical)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: get_sortition_info()] [Edge Case] What happens if is_shadow_tenure() returns true but sortition_sn.sortition is also true? Can this impossible state occur due to database corruption, and how is it handled? (High)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: try_handle_request()] [Edge Case] If the burnchain tip is at genesis (block height 0), can the LatestAndLast query cause underflow or return invalid data? (Medium)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: get_sortition_info()] [Edge Case] Can block_commit.parent_block_ptr point to a block height higher than the current sortition height, indicating a malformed commit that should be rejected? (High)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: get_sortition_info()] [Edge Case] If num_sortitions is 0 for a winning sortition, does the optimization check on line 216-217 cause integer underflow when calculating expected parent sortitions? (Medium)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: try_parse_request()] [DoS] Can an attacker send thousands of concurrent requests with different query parameters to exhaust database connection pools or MARF read locks? (High)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: new_get_sortition()] [Input Validation] Does new_get_sortition() on lines 433-445 validate that sort_key and sort_value are properly formatted before constructing the URL, or can injection attacks occur? (Medium)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: try_handle_request()] [Resource Limits] Is there a timeout or maximum execution time for database queries, or can expensive queries (e.g., searching through many non-winning sortitions) cause indefinite blocking? (Medium)",
  "[File: stackslib/src/net/api/getsortition.rs] [Constant: PATH_REGEX] [ReDoS] Does the regex pattern allow for polynomial-time worst-case matching that could be exploited for regex denial-of-service attacks? (Medium)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: try_handle_request()] [Fork Safety] When using index_handle_at_tip() on lines 318, 322, 332, can a burnchain reorg cause the tip to change mid-request, resulting in data from different forks being mixed in the response? (Critical)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: get_sortition_info()] [Fork Consistency] If a PoX reorg occurs between querying the sortition snapshot and calling get_sortition_info(), can this cause parent tenure lookups to fail or return incorrect data? (High)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: try_handle_request()] [Chain Selection] Does get_block_snapshot_consensus() on line 315 always return snapshots from the canonical chain, or can it return orphaned snapshots that are no longer valid? (Critical)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: get_sortition_info()] [Consensus Divergence] Can two nodes with identical blockchain state return different SortitionInfo for the same query due to nondeterminism in database query ordering or hash map iteration? (Critical)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: get_sortition_info()] [Time-of-Check-Time-of-Use] Between checking sortition_sn.sortition on line 160 and accessing winning_block_txid on line 190, can a reorg invalidate the sortition, causing stale data to be used? (High)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: try_handle_request()] [State Consistency] Does with_node_state() on line 311 provide atomic snapshot isolation, or can interleaved writes from block processing corrupt the read view mid-query? (Critical)",
  "[File: stackslib/src/net/api/getsortition.rs] [Function: get_sortition_info()] [Nakamoto Compatibility] For shadow tenures (lines 165-188), does the committed_block_hash correctly point to the parent tenure's first block, or can it point to an intermediate block violating tenure boundaries? (High)",
  "[File: stackslib/src/net/api/getsortition.rs] [Lines: 156-158] [Error Propagation] If is_shadow_tenure() returns an error, is it properly propagated, or can it be silently treated as false, causing shadow blocks to be misclassified? (High)",
  "[File: stackslib/src/net/api/getsortition.rs] [Lines: 190-198] [Error Handling] If get_block_commit() succeeds but returns a block commit with invalid/malformed fields, will the subsequent operations catch this or propagate invalid data? (High)",
  "[File: stackslib/src/net/api/getsortition.rs] [Lines: 200-209] [Error Handling] If get_block_snapshot_by_height() returns None on line 201, does this always indicate the block commit is invalid, or can valid commits reference heights that temporarily don't exist due to reorgs? (Medium)",
  "[File: stackslib/src/net/api/getsortition.rs] [Lines: 216-226] [Logic Correctness] Is the sortitions_incremented_by_1 optimization valid for all consensus rules, or can special cases (e.g., PoX boundaries, shadow blocks) cause it to return incorrect last_sortition_ch? (High)"
]