[
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Cross-Function] [Rejection Then Stack] Can a user reject-pox for next cycle at line 632, then call stack-stx for the same cycle, violating the rejection check at line 394? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Cross-Function] [Partial Stack Without Commit] Can delegate-stack-stx add partial stakes at line 613 without ever calling stack-aggregation-commit, leaving STX locked but not earning rewards? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Cross-Function] [Multiple Delegates] Can multiple delegates call delegate-stack-stx for the same stacker if delegation amount is split, potentially over-locking STX? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Cross-Function] [Revoke During Lock] Can revoke-delegate-stx be called while delegate-stack-stx has locked the user's STX, leaving funds locked to a revoked delegate? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Cross-Function] [Commit Multiple Times] Can stack-aggregation-commit be called multiple times for the same reward cycle but different amounts, multiplying rewards? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Economic] [Minimum Threshold Gaming] If stx-liquid-supply decreases between cycles, can stackers who met the minimum threshold in earlier cycles be below threshold in later cycles but still receive rewards? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Economic] [Reward Splitting] Can an attacker split their STX across many small partial stakes below the minimum threshold, then selectively commit only some to game reward distribution? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Economic] [Griefing] Can an attacker repeatedly call reject-pox with dust amounts to grief legitimate stackers by getting close to the rejection threshold? (Low)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Economic] [Front-Running] Can an attacker observe a large stack-stx transaction in the mempool and front-run it to claim reward slots, forcing the victim's transaction to fail? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Consensus] [Reward Set Determinism] Is the reward-cycle-pox-address-list at line 100-106 ordered deterministically, or can different nodes produce different orderings leading to fork? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Consensus] [Cycle Boundary] At reward cycle boundaries, can transactions processed in different orders on different nodes cause divergent reward sets? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Consensus] [Prepare Phase] Is there a prepare phase mechanism that prevents stacking in the last portion of a cycle, and is it enforced correctly? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Consensus] [Liquid Supply] Does stx-liquid-supply change deterministically across all nodes, or can supply differences cause nodes to calculate different minimum thresholds? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Error Handling] [Unreachable Error] At line 305, ERR_STACKING_UNREACHABLE is returned if fold doesn't match expected cycles - can this ever occur legitimately? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Error Handling] [Error Code Gaps] Error codes skip from ERR_STACKING_PERMISSION_DENIED (9) to ERR_STACKING_THRESHOLD_NOT_MET (11) - are error codes 7, 8, 10, 14, 15, 16 used elsewhere? (Low)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Arithmetic] [Addition Safety] At line 284, is (+ amount-ustx total-ustx) checked for overflow, or can large stakes wrap to small totals? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Arithmetic] [Multiplication Safety] At line 151, is (* u100 reject-votes) checked for overflow before comparing with (* rejection-fraction stx-liquid-supply)? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Arithmetic] [Division by Zero] At line 158 and 350, are divisions protected against zero denominators from corrupted configuration? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Edge Case] [Zero Lock Period] Can lock-period be set to zero in stack-stx or delegate-stack-stx, bypassing lock-period validation at line 361? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Edge Case] [Maximum Lock Period] Can lock-period exceed MAX_POX_REWARD_CYCLES (presumably 12), and what happens to excess cycles? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Edge Case] [First Reward Cycle Zero] Can first-reward-cycle be set to u0, and does this cause issues with cycle 0 calculations? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Edge Case] [PoX Address Hashbytes] At line 64, hashbytes is (buff 20) - can shorter or longer buffers be used for different address types? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Edge Case] [PoX Address Version] At line 64, version is (buff 1) - are all Bitcoin address versions single byte, or can multi-byte versions exist? (Low)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Data Consistency] [Stacking vs Partial] If stacking-state shows a user is stacking, but partial-stacked-by-cycle also has entries, which takes precedence? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox.clar] [Data Consistency] [Delegation vs Stacking] If both delegation-state and stacking-state have entries for the same principal, what prevents conflicting operations? (High)"
]