[
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Contract Integration] [Reward Distribution] When lockups are retrieved via get-lockups, what external contract or system is responsible for actually distributing the funds, and could that integration point be exploited? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Contract Integration] [Stacking Requirements] Are lockups subject to minimum stacking amounts or other PoX requirements, and is this enforced at map population time or distribution time? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Function: get-lockups] [Chain Reorganization] If a chain reorganization changes the current block-height, could get-lockups return different results for the same query, and how does this affect consensus on lockup distribution? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Map: lockups] [State Consistency] During a fork, if two chains have different lockup schedules at the same block height, how is the canonical version determined, and could this lead to double-distribution? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Map: lockups] [MARF State] How is the lockups map stored in the MARF, and could inconsistencies in state root hashing cause nodes to diverge on lockup schedules? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Function: get-lockups] [Read Cost] What is the Clarity VM runtime cost for reading a map entry with 4430 list elements, and does this cost scale linearly or could it cause unexpected behavior at maximum capacity? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Map: lockups] [Storage Cost] What is the storage cost for each map entry, and could an attacker exploit predictable block heights to pre-allocate expensive storage? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Function: get-lockups] [Nested default-to] The function uses nested default-to operations - could this double-default behavior mask errors or return unexpected empty lists when explicit failures should occur? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Map: lockups] [List Entry Validation] Is there any validation that each list entry contains exactly two fields (recipient and amount), or could malformed entries cause parsing errors? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Map: lockups] [List Completeness] If the list is supposed to contain exactly 4430 entries but contains fewer, does this indicate corruption or is partial population expected? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Map: lockups] [Type Safety] The map type definition specifies (list 4430 {...}) - does the Clarity type system enforce this at runtime, or could lists exceeding this size be stored through other mechanisms? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Contract Deployment] [Genesis State] Is this contract deployed at genesis with pre-populated lockup schedules, and if so, how is that data validated for correctness before network launch? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Contract Deployment] [Boot Contract Status] As a boot contract, does this have special privileges or protections that prevent it from being upgraded or replaced, and could this create irreversible errors? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Function: get-lockups] [Block Height Timing] When lockups are scheduled for block height N, are they distributed at the start of block N, end of block N, or beginning of block N+1, and could off-by-one errors cause premature or delayed distributions? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Map: lockups] [List Index] The list size is 4430 (0-4429 indices) - are there any off-by-one errors in external code that iterates over this list or attempts to access index 4430? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Function: get-lockups] [Call Context] Since this is a read-only function, can it be called from any context (contract-call, direct read), and could different calling contexts return different results? (Low)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Function: get-lockups] [Block Height Context] The function reads block-height from the execution context - is this always the current chain tip, or could it reflect different values in different execution scenarios? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Map: lockups] [Economic Incentives] Could miners or stackers manipulate which lockup schedules are queried by controlling block production timing, potentially delaying or advancing distributions for economic gain? (High)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Map: lockups] [Front-Running] If lockup distributions are predictable based on block height, could sophisticated actors front-run distributions by observing which lockups will unlock soon? (Medium)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Function: get-lockups] [Deterministic Execution] Is the execution of get-lockups fully deterministic across all nodes, or could differences in block-height timing or map state cause consensus divergence? (Critical)",
  "[File: stacks-core/stackslib/src/chainstate/stacks/boot/lockup.clar] [Map: lockups] [Map Ordering] Does the Clarity map guarantee deterministic ordering of entries, and could non-deterministic ordering cause nodes to process lockups differently? (Critical)"
]