[
  "[File: stacks-core/stacks-node/src/genesis_data.rs] [Constant: USE_TEST_GENESIS_CHAINSTATE] [Consensus Divergence] Could different nodes in the network compile with different feature flags (with/without 'prod-genesis-chainstate'), causing some production nodes to use test genesis data while others use production genesis data, leading to consensus divergence and chain forks at genesis block validation? (Critical)",
  "[File: stacks-core/stacks-node/src/genesis_data.rs] [Constant: USE_TEST_GENESIS_CHAINSTATE] [Configuration Error] If the feature flag 'prod-genesis-chainstate' is accidentally enabled during production deployments or accidentally disabled during test runs, could this cause nodes to load incorrect genesis data (test data in production or production data in tests), leading to state initialization mismatches? (High)",
  "[File: stacks-core/stacks-node/src/genesis_data.rs] [Conditional Compilation] [State Root Mismatch] Since the USE_TEST_GENESIS_CHAINSTATE constant is set at compile time rather than runtime, could nodes compiled with different configurations produce different genesis state roots, causing permanent consensus incompatibility that cannot be detected or resolved without recompilation? (Critical)",
  "[File: stacks-core/stacks-node/src/genesis_data.rs] [Constant: USE_TEST_GENESIS_CHAINSTATE] [Build Configuration Attack] Could an attacker who compromises the build pipeline inject the wrong feature flag configuration, causing production binaries to use test genesis data with known private keys or reduced security parameters, enabling theft of genesis-allocated STX tokens? (Critical)",
  "[File: stacks-core/stacks-node/src/genesis_data.rs] [Test Configuration] [Replay Attack] If test genesis chainstate data contains accounts with known or weak private keys, and a production node accidentally uses USE_TEST_GENESIS_CHAINSTATE=true, could an attacker immediately drain all genesis accounts by replaying transactions using the known test keys? (Critical)",
  "[File: stacks-core/stacks-node/src/genesis_data.rs] [Conditional Compilation] [Determinism Violation] Does the compile-time selection between test and production genesis data mean that node binaries are not deterministically reproducible across different build configurations, making it impossible to verify that all network participants are running identical consensus code? (High)",
  "[File: stacks-core/stacks-node/src/genesis_data.rs] [Feature Flag: prod-genesis-chainstate] [Test Pollution] If the 'prod-genesis-chainstate' feature is enabled during regular test execution (cargo test --features prod-genesis-chainstate), could this cause tests to inadvertently validate against production genesis data, missing bugs that only manifest with test data, or cause extremely slow test execution due to large production datasets? (Medium)",
  "[File: stacks-core/stacks-node/src/genesis_data.rs] [Constant: USE_TEST_GENESIS_CHAINSTATE] [Documentation Gap] Is there explicit documentation and validation that ensures all production deployments compile without test flags and all test environments compile with test flags, or could silent misconfiguration lead to nodes with wrong genesis data being deployed to production networks? (Medium)"
]