[
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: set-burnchain-parameters()] [Initialization Bypass] Can an attacker race to call set-burnchain-parameters() during contract deployment with malicious parameters before legitimate initialization, gaining permanent control over reward cycle lengths and first burnchain block height? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: set-burnchain-parameters()] [Integer Overflow] Can setting extremely large values for prepare-cycle-length or reward-cycle-length cause integer overflow in reward-cycle-to-burn-height() calculations, breaking reward cycle boundaries? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: set-burnchain-parameters()] [State Corruption] If begin-pox-4-reward-cycle is set to a cycle in the past relative to first-burn-height, can this cause negative cycle calculations or allow stacking in already-completed reward cycles? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: stack-stx()] [Signature Replay] Can an attacker reuse a valid signer-sig from a previous transaction to stack STX in a different reward cycle if the signature was generated for a different period, bypassing the cycle-specific authorization? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: stack-stx()] [Authorization Bypass] If a user calls stack-stx() with signer-sig as none but no prior authorization exists in signer-key-authorizations map, can they bypass signer key validation by exploiting the default-to false logic in verify-signer-key-sig()? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: stack-stx()] [Off-by-One Error] When calculating first-reward-cycle as (+ u1 (current-pox-reward-cycle)), can a transaction confirmed at the exact boundary between reward cycles cause the stacker to miss the intended cycle or double-stack? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: stack-stx()] [Amount Validation] Can amount-ustx be set to exactly the stacking minimum while max-amount in signer authorization is less, allowing the signature check to pass but violating the intended authorization limit? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: stack-stx()] [State Inconsistency] If add-pox-addr-to-reward-cycles() succeeds but the subsequent map-set to stacking-state fails or is interrupted, will the PoX address be registered in reward cycles without a corresponding stacker record, violating invariant (1)? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: stack-stx()] [Lock Period Overflow] If lock-period is set to MAX_POX_REWARD_CYCLES (u12) and first-reward-cycle is near the maximum uint value, will (+ first-reward-cycle lock-period) overflow when computing unlock-burn-height? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: stack-stx()] [Delegation Check Bypass] Can a user who has delegated STX still call stack-stx() if their delegation has expired (until-burn-ht exceeded), allowing them to stack while delegation state still exists but is stale? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: stack-stx()] [Signer Key Reuse] If signer-key is reused across multiple stackers in the same reward cycle with different PoX addresses, will this cause DKG signature aggregation failures or reward distribution conflicts? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: stack-stx()] [Start Height Manipulation] Can an attacker specify start-burn-ht at the very end of the current reward cycle to game the (+ u1 (burn-height-to-reward-cycle start-burn-ht)) calculation and backdoor into a specific reward cycle? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: consume-signer-key-authorization()] [Replay Prevention Bypass] Can an attacker reuse an authorization by calling verify-signer-key-sig() read-only to check validity, then frontrun the legitimate transaction to consume it first? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: consume-signer-key-authorization()] [Map Insert Race] If map-insert to used-signer-key-authorizations returns false (already exists), but verify-signer-key-sig() passed, can this indicate a race condition where the authorization was consumed concurrently? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: consume-signer-key-authorization()] [Authorization Tuple Collision] Can two different authorizations with identical (signer-key, reward-cycle, topic, period, pox-addr, auth-id, max-amount) but different signatures collide in the used-signer-key-authorizations map, causing the second to be rejected incorrectly? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: verify-signer-key-sig()] [Signature Malleability] Can an attacker modify the signer-sig (65-byte buffer) to create a different valid signature for the same message hash, bypassing the used-signer-key-authorizations check since the map key doesn't include the signature itself? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: verify-signer-key-sig()] [Public Key Recovery Bypass] If secp256k1-recover? returns an unexpected public key format that matches signer-key due to encoding differences, can invalid signatures pass verification? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: verify-signer-key-sig()] [Amount Comparison Logic] If amount equals max-amount exactly at the boundary (>= max-amount amount check), can rounding errors or arithmetic precision issues cause legitimate transactions to be rejected? (Low)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: verify-signer-key-sig()] [Pre-Authorization Override] Can an attacker set a pre-authorization with allowed=false in signer-key-authorizations to DoS legitimate stacking attempts that don't provide a signature? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: get-signer-key-message-hash()] [Hash Collision] Can different combinations of (pox-addr, reward-cycle, topic, period, auth-id, max-amount) produce identical SHA256 hashes due to to-consensus-buff? encoding ambiguities? (Critical)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: get-signer-key-message-hash()] [Domain Separator Weakness] If chain-id is manipulated or identical across test/mainnet, can signatures from one network be replayed on another despite the SIP018 domain? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: delegate-stx()] [Delegation Overwrite] Can a stacker call delegate-stx() multiple times with different delegates, and does each call overwrite the previous delegation without requiring revocation, potentially enabling delegation frontrunning? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: delegate-stx()] [Expired Delegation DoS] If until-burn-ht is set to current burn height or u0, can this create an immediately-expired delegation that blocks the stacker from delegating again until they call revoke-delegate-stx()? (Medium)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: delegate-stx()] [PoX Address Binding] If pox-addr is specified in delegation, can the delegate still use a different address by exploiting timing between delegation and delegate-stack-stx() calls? (High)",
  "[File: stackslib/src/chainstate/stacks/boot/pox-4.clar] [Function: delegate-stx()] [Amount Escalation] Can amount-ustx be set higher than the stacker's actual balance, and will delegate-stack-stx() fail only at lock-time, allowing delegates to commit partial amounts that bypass minimum thresholds? (Medium)"
]